{
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "O",
    "1": "B-SOCIAL_MEDIA_ACCOUNT",
    "2": "I-SOCIAL_MEDIA_ACCOUNT",
    "3": "B-ADDRESS",
    "4": "I-ADDRESS",
    "5": "B-BANK_ACCOUNT",
    "6": "I-BANK_ACCOUNT",
    "7": "B-BIOMETRIC_DATA",
    "8": "I-BIOMETRIC_DATA",
    "9": "B-BIRTH_DATE_PLACE",
    "10": "I-BIRTH_DATE_PLACE",
    "11": "B-CLOTHING",
    "12": "I-CLOTHING",
    "13": "B-CREDIT_CARD_NUMBER",
    "14": "I-CREDIT_CARD_NUMBER",
    "15": "B-CREDIT_SCORE",
    "16": "I-CREDIT_SCORE",
    "17": "B-CRIMINAL_RECORD",
    "18": "I-CRIMINAL_RECORD",
    "19": "B-EMAIL",
    "20": "I-EMAIL",
    "21": "B-ETHNIC_ORIGIN",
    "22": "I-ETHNIC_ORIGIN",
    "23": "B-FINANCIAL_DATA",
    "24": "I-FINANCIAL_DATA",
    "25": "B-GENDER",
    "26": "I-GENDER",
    "27": "B-GENETIC_DATA",
    "28": "I-GENETIC_DATA",
    "29": "B-HEALTH_INFO",
    "30": "I-HEALTH_INFO",
    "31": "B-IBAN",
    "32": "I-IBAN",
    "33": "B-INCOME_EXPENSE",
    "34": "I-INCOME_EXPENSE",
    "35": "B-IP_ADDRESS",
    "36": "I-IP_ADDRESS",
    "37": "B-LOCATION",
    "38": "I-LOCATION",
    "39": "B-NAME",
    "40": "I-NAME",
    "41": "B-PHILOSOPHICAL_BELIEF",
    "42": "I-PHILOSOPHICAL_BELIEF",
    "43": "B-PHONE",
    "44": "I-PHONE",
    "45": "B-PLATE_NUMBER",
    "46": "I-PLATE_NUMBER",
    "47": "B-POLITICAL_OPINION",
    "48": "I-POLITICAL_OPINION",
    "49": "B-RACE",
    "50": "I-RACE",
    "51": "B-RELIGION_OR_SECT",
    "52": "I-RELIGION_OR_SECT",
    "53": "B-SEXUAL_LIFE",
    "54": "I-SEXUAL_LIFE",
    "55": "B-SURNAME",
    "56": "I-SURNAME",
    "57": "B-TCKN",
    "58": "I-TCKN",
    "59": "B-TRANSACTION_HISTORY",
    "60": "I-TRANSACTION_HISTORY",
    "61": "B-UNION_MEMBERSHIP",
    "62": "I-UNION_MEMBERSHIP"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-ADDRESS": 3,
    "B-BANK_ACCOUNT": 5,
    "B-BIOMETRIC_DATA": 7,
    "B-BIRTH_DATE_PLACE": 9,
    "B-CLOTHING": 11,
    "B-CREDIT_CARD_NUMBER": 13,
    "B-CREDIT_SCORE": 15,
    "B-CRIMINAL_RECORD": 17,
    "B-EMAIL": 19,
    "B-ETHNIC_ORIGIN": 21,
    "B-FINANCIAL_DATA": 23,
    "B-GENDER": 25,
    "B-GENETIC_DATA": 27,
    "B-HEALTH_INFO": 29,
    "B-IBAN": 31,
    "B-INCOME_EXPENSE": 33,
    "B-IP_ADDRESS": 35,
    "B-LOCATION": 37,
    "B-NAME": 39,
    "B-PHILOSOPHICAL_BELIEF": 41,
    "B-PHONE": 43,
    "B-PLATE_NUMBER": 45,
    "B-POLITICAL_OPINION": 47,
    "B-RACE": 49,
    "B-RELIGION_OR_SECT": 51,
    "B-SEXUAL_LIFE": 53,
    "B-SOCIAL_MEDIA_ACCOUNT": 1,
    "B-SURNAME": 55,
    "B-TCKN": 57,
    "B-TRANSACTION_HISTORY": 59,
    "B-UNION_MEMBERSHIP": 61,
    "I-ADDRESS": 4,
    "I-BANK_ACCOUNT": 6,
    "I-BIOMETRIC_DATA": 8,
    "I-BIRTH_DATE_PLACE": 10,
    "I-CLOTHING": 12,
    "I-CREDIT_CARD_NUMBER": 14,
    "I-CREDIT_SCORE": 16,
    "I-CRIMINAL_RECORD": 18,
    "I-EMAIL": 20,
    "I-ETHNIC_ORIGIN": 22,
    "I-FINANCIAL_DATA": 24,
    "I-GENDER": 26,
    "I-GENETIC_DATA": 28,
    "I-HEALTH_INFO": 30,
    "I-IBAN": 32,
    "I-INCOME_EXPENSE": 34,
    "I-IP_ADDRESS": 36,
    "I-LOCATION": 38,
    "I-NAME": 40,
    "I-PHILOSOPHICAL_BELIEF": 42,
    "I-PHONE": 44,
    "I-PLATE_NUMBER": 46,
    "I-POLITICAL_OPINION": 48,
    "I-RACE": 50,
    "I-RELIGION_OR_SECT": 52,
    "I-SEXUAL_LIFE": 54,
    "I-SOCIAL_MEDIA_ACCOUNT": 2,
    "I-SURNAME": 56,
    "I-TCKN": 58,
    "I-TRANSACTION_HISTORY": 60,
    "I-UNION_MEMBERSHIP": 62,
    "O": 0
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.54.1",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
